""" ============================ 如果没有目录就创建 """
import os

path = '/Users/gladd/Desktop'
if not os.path.exists(path):
    os.makedirs(path)

""" ============================ 打开文件保存成数组 """
with open(path) as f:
    need_found_pnr = [i.strip() for i in f]

""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
""" ============================ 如果没有目录就创建 """
