""" ============================
标签数据:label
无标签数据:
特征feature
样本
聚类算法

连续和离散说的都是预测的结果值
降维: 样本可能有很多维度, 用主要的维度进行分析
"""


""" ============================ 
机器学习种类:
    监督学习
        回归分析
        分类预测
    无监督学习
        聚类: 例如, 根据衣服的特征颜色, 材质等将衣服分类
        关联规则
    半监督模式
    强化学习
        Q-learning
        时间差学习  
    

 
    
1. 多个样本, 每个样本的特征
2. 通过学习的结果对新的样本进行预测

3. 监督学习: 学的样本里有结果
4. 无监督学习: 学习的样本里没有结果

连续值: 回归类问题
离散值: 分类


* 主要学习有监督和无监督学习




监督学习: 根据已有的数据集，知道输入和输出结果之间的关系. 训练数据有特征和标签，通过训练，让机器可以自己找到特征和标签之间的联系，在面对只有特征没有标签的数据时，可以判断出标签
回归任务: 针对连续变量. 预测变量值, 通过一组给定的特征预测一个目标值
分类任务: 针对离散型. 要通过分析输入的特征向量，对于一个新的向量得到其标签
无监督学习: 不知道数据集中数据、特征之间的关系，而是要根据聚类或一定的模型得到数据之间的关系. 比起监督学习，无监督学习更像是自学
半监督模式: 大量未标记的数据和少量标记的数据


批量学习: 使用所有可用的数据进行训练, 离线形式完成. 每次使用全套数据学习花费很多时间和资源 
在线学习: 新的数据经过系统学习可以丢弃, 节省空间. 


基于实例的学习: 系统完全记住学习实例, 通过相似度方式将其泛化到新的实例
基于模型的学习: 

泛化: 
学习率: 
增量学习: 
离线学习: 先训练系统再投入生产环境

监督学习算法: K近临算法, 线性回归, 逻辑回归, 支持向量机, 决策树和随机森林, 神经网络

聚类算法: K平均算法, 分成聚类分析, 最大期望算法, 
可视化和降维: 主成分分析, 核主成分分析, 局部线性嵌入, t-分布随机近邻嵌入
关联规则学习: Apriori, Eclat

可视化: 提供大量复杂的未标记的数据, 




在线学习
批量学习



"""



