"""================元组做形参"""
# 在Python3之前，元组可以作为形参放在函数声明中，例如deffn(a,(b,c),d):。
# 然而Python3不再支持这种格式.这个改变对函数调用者并没有影响，它改变的是某些函数的声明方式。

"""================拆包"""
a, b, c = [10, 20, 30]
d, e, f = (1, 2, 3)
print(a, b, c, d, e, f)  # 10 20 30 1 2 3
a, b, c = (1, 2, (3, 4))
print(a, b, c)  # 1 2 (3, 4)

"""================平行赋"""
# python3: *前缀只能用在一个变量名前面，但是这个变量可以出现在赋值表达式的任意位置
a, b, *rest = range(5)
print(a, b, rest)  # 0 1 [2, 3, 4]
a, *body, c = range(5)
print(a, body, c)  # 0 [1, 2, 3] 4

"""================异常情况"""
# 虽然会报异常, 但是j的值还是被修改了
j = (1, 2, [30, 40])
try:
    j[2] += [50, 60]
except Exception as e:
    print(e)  # 0 [1, 2, 3] 4
    print(j)  # (1, 2, [30, 40, 50, 60])
